print("Привет !")
print("Ты любишь свою родину?")
n=input()
if n=="Да":
    print("Хорошо. Итак:")
else:
    print("Это конечно обидно, но:")
print("Ты чтишь память страны, в которой проживаешь?")

x=input()
if x=="Да":
    print("Отлично!")
else:
    print("Ну и ладно.")
print("Не поможешь ли ты мне? Я к сожалению позабыл.")
print("Сколько лет прошло со дня победа в ВОВ?")
print("1)            --------          --------          2) ---     ---    --------      3)   ---------    ----------")
print("             /        \        -        -            ---     ---        ----                   /    ----      ")
print("            /          \       -        -            ---     ---        ----                  /     ----      ")
print("             ----------        -        -            -----------    --------                 /      ----------")
print("            /           \      -        -                    ---    ----                    /             ----")
print("           /             \     -        -                    ---    ----                   /              ----")
print("           --------------      ---------                     ---    --------              /         ----------")
print("Напиши 1/2/3")
z=int(input())
if z==1:
    print("Да, верно, припоминаю.")
elif z==2:
    print("Не, ты что, за ложник интернета, брат?")
elif z==3:
    print("Вроде немного больше.")
else:
    print("Ты уверен, что такой вариант ответа есть?")
print("Кстати, на днях меня попросили спеть песню про технику Великой Отечественной войны и одноимённой девочке.")
print("Сможешь ли ты написать знаменитый первый абзац этой песни?(без красных строк).")
y=input()
while y!="Расцветали яблони и груши, Поплыли туманы над рекой. Выходила на берег Катюша, На высокий берег на крутой.":
    print("Ты уверен?")
    y=input()
print("Верно это она! Великолепно, ты справился!")
print("   ____________           ____________            ______      ______        _______          __________")
print("  |||||                   ||        ||           /      \    /      \      /       \         ||      ||")
print("  |||||                   ||        ||          /        \  /        \    /    |    \        ||      ||")
print("  |||||                   ____________         /   3      \/     3    \   |  |||||  |        __________")
print("  |||||                             ||         |                      |   |||||||||||            / / ||")
print("  |||||                             ||         |        /    \            |         |           / /  ||")
print("  _____________           ____________         ________________________   ___________           __   __")

        
